Tekla Open API Reference for Tekla Structures 2025
AngleDimension Constructor
Overload List
Name | Description
AngleDimension(ViewBase, Point, Point, Point, Double)
 Creates a new angle dimension instance using three points.
AngleDimension(ViewBase, Point, Vector, Vector, Double)
 Creates a new angle dimension instance using the origin and two vectors relative to the origin.
AngleDimension(ViewBase, Point, Point, Point, Double, AngleDimensionAttributes)
 Creates a new angle dimension instance using three points.
AngleDimension(ViewBase, Point, Vector, Vector, Double, AngleDimensionAttributes)
 Creates a new angle dimension instance using the origin and two vectors relative to the origin.
Top
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace